package class_and_object;

public class Abstraction {


    /*
     * 객체 지향 프로그래밍
     * 현실세계으 모든 사건(event)는 객체와 객체의 상호작용에 의해 일어난다는 세계관을
     * 프로그램을 만들 때 이용하여 새로운 세계를 창조하는 방법론이다.
     *
     * 현실세계와 닮았지만 현실 세계와 다른 점은,
     * 객체 간의 상호작용을 한다는 사실은 현실 세계와 동일하지만 의인화기법이 적용되어
     * 현시세계에서 불가능한 무생물이나 개념 같은 존재들도 하나의 주제로
     * 본인의 상태를 스스로 제어하고 행동하도록 한다는 것이 현실 세계와는 다른 점이다. (<-캡슐화의 의미)
     *
     * 모든 객체는 책임을 가지고 자신의 역할을 수행한다는 의미이다.
     * 또한 하나의 객체는 너무 많은 일을 수행하는 것이 아닌 적절한 책임을 가지고 있어야 한다.
     * */

    /** 추상화란 ?
     *
     * 공통된 부분을 추출하고 공통되지 않은 부분을 제거한다는 의미를 가지며, 추상화의 목적은 유연성을
     * 확보하기 위함이다.
     * */

    /* 카레이서가 자동차를 운전하는 프로그램을 만들려고 한다.

    * */
}
